-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\jbarg\PycharmProjects\corporate_disruptions\workbooks\10.Run models.log
  log type:  text
 opened on:  26 Apr 2019, 02:28:34

. do "H:\jbarg\PycharmProjects\corporate_disruptions\workbooks\10. Run models.do"

. use "H:\jbarg\PycharmProjects\corporate_disruptions\preprocessed\pace_delta_3 2019-04-26.dta"

. xtset name year, delta(3)
       panel variable:  name (unbalanced)
        time variable:  year, 2011 to 2014
                delta:  3 units

. 
. xtreg recalls_3 high_turnover_3 revenue_3 ceo_exit_3, fe robust

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.2334                                         min =          1
     between = 0.4615                                         avg =        1.9
     overall = 0.4428                                         max =          2

                                                F(3,36)           =       2.84
corr(u_i, Xb)  = 0.2418                         Prob > F          =     0.0514

                                     (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------
                |               Robust
      recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   2.067526   .9845541     2.10   0.043     .0707581    4.064295
      revenue_3 |   .0000676   .0000635     1.06   0.295    -.0000613    .0001964
     ceo_exit_3 |   .7475872   1.040007     0.72   0.477    -1.361644    2.856819
          _cons |  -.3024003   3.294343    -0.09   0.927    -6.983637    6.378836
----------------+----------------------------------------------------------------
        sigma_u |  6.1162469
        sigma_e |   2.591142
            rho |  .84783233   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg recalls_3 high_turnover_3 revenue_3 ceo_exit_3, fe

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.2334                                         min =          1
     between = 0.4615                                         avg =        1.9
     overall = 0.4428                                         max =          2

                                                F(3,31)           =       3.15
corr(u_i, Xb)  = 0.2418                         Prob > F          =     0.0390

---------------------------------------------------------------------------------
      recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   2.067526   .9294029     2.22   0.034     .1719967    3.963056
      revenue_3 |   .0000676   .0000475     1.42   0.165    -.0000293    .0001644
     ceo_exit_3 |   .7475872   1.440386     0.52   0.607    -2.190099    3.685273
          _cons |  -.3024003   2.478924    -0.12   0.904    -5.358199    4.753398
----------------+----------------------------------------------------------------
        sigma_u |  6.1162469
        sigma_e |   2.591142
            rho |  .84783233   (fraction of variance due to u_i)
---------------------------------------------------------------------------------
F test that all u_i=0: F(36, 31) = 8.17                      Prob > F = 0.0000

. estimate store fe

. 
. xtreg recalls_3 high_turnover_3 revenue_3, fe robust

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.2267                                         min =          1
     between = 0.4532                                         avg =        1.9
     overall = 0.4340                                         max =          2

                                                F(2,36)           =       3.48
corr(u_i, Xb)  = 0.2683                         Prob > F          =     0.0414

                                     (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------
                |               Robust
      recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   2.174929   .9432833     2.31   0.027     .2618621    4.087997
      revenue_3 |   .0000624   .0000642     0.97   0.338    -.0000679    .0001927
          _cons |  -.0108064   3.345466    -0.00   0.997    -6.795727    6.774114
----------------+----------------------------------------------------------------
        sigma_u |  6.2131095
        sigma_e |  2.5613909
            rho |  .85473379   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg recalls_3 high_turnover_3 revenue_3, fe

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.2267                                         min =          1
     between = 0.4532                                         avg =        1.9
     overall = 0.4340                                         max =          2

                                                F(2,32)           =       4.69
corr(u_i, Xb)  = 0.2683                         Prob > F          =     0.0163

---------------------------------------------------------------------------------
      recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   2.174929   .8956693     2.43   0.021     .3505107    3.999348
      revenue_3 |   .0000624   .0000459     1.36   0.184    -.0000311     .000156
          _cons |  -.0108064   2.386698    -0.00   0.996    -4.872351    4.850739
----------------+----------------------------------------------------------------
        sigma_u |  6.2131095
        sigma_e |  2.5613909
            rho |  .85473379   (fraction of variance due to u_i)
---------------------------------------------------------------------------------
F test that all u_i=0: F(36, 32) = 8.35                      Prob > F = 0.0000

. estimate store fe2

. 
. xtreg recalls_3 high_turnover_3, fe robust

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1821                                         min =          1
     between = 0.0133                                         avg =        1.9
     overall = 0.0024                                         max =          2

                                                F(1,36)           =       7.22
corr(u_i, Xb)  = -0.2419                        Prob > F          =     0.0108

                                     (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------
                |               Robust
      recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   2.411765   .8976302     2.69   0.011     .5912863    4.232243
          _cons |    3.15493   .4298511     7.34   0.000     2.283151    4.026708
----------------+----------------------------------------------------------------
        sigma_u |  8.3431881
        sigma_e |  2.5940423
            rho |  .91185164   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg recalls_3 high_turnover_3, fe

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1821                                         min =          1
     between = 0.0133                                         avg =        1.9
     overall = 0.0024                                         max =          2

                                                F(1,33)           =       7.35
corr(u_i, Xb)  = -0.2419                        Prob > F          =     0.0106

---------------------------------------------------------------------------------
      recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   2.411765   .8897492     2.71   0.011     .6015564    4.221973
          _cons |    3.15493   .5256587     6.00   0.000     2.085469     4.22439
----------------+----------------------------------------------------------------
        sigma_u |  8.3431881
        sigma_e |  2.5940423
            rho |  .91185164   (fraction of variance due to u_i)
---------------------------------------------------------------------------------
F test that all u_i=0: F(36, 33) = 19.31                     Prob > F = 0.0000

. estimate store fe3

. 
. xtreg recalls_3 high_turnover_3 revenue_3 ceo_exit_3, re robust

Random-effects GLS regression                   Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1847                                         min =          1
     between = 0.5554                                         avg =        1.9
     overall = 0.5308                                         max =          2

                                                Wald chi2(3)      =      14.78
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0020

                                     (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------
                |               Robust
      recalls_3 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   .9313293   1.125292     0.83   0.408    -1.274202     3.13686
      revenue_3 |   .0001081   .0000301     3.60   0.000     .0000492    .0001671
     ceo_exit_3 |   .7720727    .933859     0.83   0.408    -1.058257    2.602403
          _cons |  -1.900387   1.079741    -1.76   0.078    -4.016641    .2158666
----------------+----------------------------------------------------------------
        sigma_u |  4.9790121
        sigma_e |   2.591142
            rho |  .78688758   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg recalls_3 high_turnover_3 revenue_3 ceo_exit_3, re

Random-effects GLS regression                   Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1847                                         min =          1
     between = 0.5554                                         avg =        1.9
     overall = 0.5308                                         max =          2

                                                Wald chi2(3)      =      51.25
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

---------------------------------------------------------------------------------
      recalls_3 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   .9313293   .8129425     1.15   0.252    -.6620088    2.524667
      revenue_3 |   .0001081   .0000156     6.93   0.000     .0000775    .0001387
     ceo_exit_3 |   .7720727   1.402245     0.55   0.582    -1.976278    3.520423
          _cons |  -1.900387   1.247942    -1.52   0.128    -4.346309    .5455352
----------------+----------------------------------------------------------------
        sigma_u |  4.9790121
        sigma_e |   2.591142
            rho |  .78688758   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. estimate store re

. 
. xtreg recalls_3 high_turnover_3 revenue_3, re robust

Random-effects GLS regression                   Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1751                                         min =          1
     between = 0.5566                                         avg =        1.9
     overall = 0.5314                                         max =          2

                                                Wald chi2(2)      =      13.29
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0013

                                     (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------
                |               Robust
      recalls_3 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   1.036222   1.075496     0.96   0.335    -1.071711    3.144155
      revenue_3 |   .0001071     .00003     3.57   0.000     .0000483    .0001659
          _cons |   -1.82228   1.079027    -1.69   0.091    -3.937133    .2925738
----------------+----------------------------------------------------------------
        sigma_u |  4.9036158
        sigma_e |  2.5613909
            rho |   .7856405   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg recalls_3 high_turnover_3 revenue_3, re

Random-effects GLS regression                   Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1751                                         min =          1
     between = 0.5566                                         avg =        1.9
     overall = 0.5314                                         max =          2

                                                Wald chi2(2)      =      51.59
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

---------------------------------------------------------------------------------
      recalls_3 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   1.036222   .7847891     1.32   0.187    -.5019366     2.57438
      revenue_3 |   .0001071   .0000154     6.96   0.000     .0000769    .0001372
          _cons |   -1.82228    1.23222    -1.48   0.139    -4.237387    .5928282
----------------+----------------------------------------------------------------
        sigma_u |  4.9036158
        sigma_e |  2.5613909
            rho |   .7856405   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. estimate store re2

. 
. xtreg recalls_3 high_turnover_3, re robust

Random-effects GLS regression                   Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1821                                         min =          1
     between = 0.0133                                         avg =        1.9
     overall = 0.0024                                         max =          2

                                                Wald chi2(1)      =       4.63
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0313

                                     (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------
                |               Robust
      recalls_3 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   1.904474   .8846667     2.15   0.031     .1705593    3.638389
          _cons |   3.261944   1.293016     2.52   0.012     .7276799    5.796208
----------------+----------------------------------------------------------------
        sigma_u |  7.8999987
        sigma_e |  2.5940423
            rho |  .90267357   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg recalls_3 high_turnover_3, re

Random-effects GLS regression                   Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1821                                         min =          1
     between = 0.0133                                         avg =        1.9
     overall = 0.0024                                         max =          2

                                                Wald chi2(1)      =       5.11
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0237

---------------------------------------------------------------------------------
      recalls_3 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   1.904474   .8421433     2.26   0.024     .2539037    3.555045
          _cons |   3.261944   1.409824     2.31   0.021     .4987391    6.025149
----------------+----------------------------------------------------------------
        sigma_u |  7.8999987
        sigma_e |  2.5940423
            rho |  .90267357   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. estimate store re3

. 
. hausman fe re

Note: the rank of the differenced variance matrix (2) does not equal the number of coefficients being tested (3); be sure this is what you expect, or there may be problems
        computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a
        similar scale.

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |       fe           re         Difference          S.E.
-------------+----------------------------------------------------------------
high_turno~3 |    2.067526     .9313293        1.136197        .4504599
   revenue_3 |    .0000676     .0001081       -.0000406        .0000449
  ceo_exit_3 |    .7475872     .7720727       -.0244855        .3292702
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(2) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =        6.42
                Prob>chi2 =      0.0403

. hausman fe2 re2

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |      fe2          re2         Difference          S.E.
-------------+----------------------------------------------------------------
high_turno~3 |    2.174929     1.036222        1.138707         .431659
   revenue_3 |    .0000624     .0001071       -.0000447        .0000433
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(2) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =        6.96
                Prob>chi2 =      0.0308

. hausman fe3 re3

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |      fe3          re3         Difference          S.E.
-------------+----------------------------------------------------------------
high_turno~3 |    2.411765     1.904474        .5072904         .287138
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(1) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =        3.12
                Prob>chi2 =      0.0773

. 
. xtreg recalls_3 elevated_turnover_3 revenue_3 ceo_exit_3, fe robust

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1368                                         min =          1
     between = 0.5794                                         avg =        1.9
     overall = 0.5509                                         max =          2

                                                F(3,36)           =       1.50
corr(u_i, Xb)  = 0.1907                         Prob > F          =     0.2307

                                         (Std. Err. adjusted for 37 clusters in name)
-------------------------------------------------------------------------------------
                    |               Robust
          recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
elevated_turnover_3 |  -.7213212   .5570616    -1.29   0.204    -1.851095    .4084521
          revenue_3 |    .000095   .0000499     1.90   0.065    -6.19e-06    .0001963
         ceo_exit_3 |    1.47599   1.006219     1.47   0.151    -.5647169    3.516696
              _cons |   .1673834   2.076064     0.08   0.936    -4.043069    4.377835
--------------------+----------------------------------------------------------------
            sigma_u |   5.334546
            sigma_e |  2.7495711
                rho |  .79009824   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. xtreg recalls_3 elevated_turnover_3 revenue_3, fe robust

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.1095                                         min =          1
     between = 0.5835                                         avg =        1.9
     overall = 0.5532                                         max =          2

                                                F(2,36)           =       1.42
corr(u_i, Xb)  = 0.2611                         Prob > F          =     0.2547

                                         (Std. Err. adjusted for 37 clusters in name)
-------------------------------------------------------------------------------------
                    |               Robust
          recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
elevated_turnover_3 |  -.7135671   .5669884    -1.26   0.216    -1.863473    .4363387
          revenue_3 |    .000087   .0000519     1.68   0.102    -.0000182    .0001922
              _cons |   .7244104   2.141508     0.34   0.737     -3.61877     5.06759
--------------------+----------------------------------------------------------------
            sigma_u |  5.4024792
            sigma_e |  2.7487573
                rho |  .79436136   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. 
. xtreg recalls_3 high_turnover_3 revenue_3 ceo_exit_3 ceo_and_high_turnover, fe robust

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.2366                                         min =          1
     between = 0.4680                                         avg =        1.9
     overall = 0.4495                                         max =          2

                                                F(4,36)           =       2.60
corr(u_i, Xb)  = 0.2219                         Prob > F          =     0.0522

                                           (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------------
                      |               Robust
            recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
      high_turnover_3 |   1.988334   1.058221     1.88   0.068    -.1578381    4.134506
            revenue_3 |   .0000708   .0000637     1.11   0.274    -.0000584       .0002
           ceo_exit_3 |  -.1669992   2.120571    -0.08   0.938    -4.467717    4.133719
ceo_and_high_turnover |   .7415744   1.569807     0.47   0.639    -2.442141     3.92529
                _cons |  -.4386482   3.268135    -0.13   0.894    -7.066733    6.189437
----------------------+----------------------------------------------------------------
              sigma_u |  6.0466518
              sigma_e |  2.6284167
                  rho |  .84107469   (fraction of variance due to u_i)
---------------------------------------------------------------------------------------

. 
. xtreg recalls_3 high_turnover_3 revenue_3 ceo_exit_3 ceo_exit_during ceo_exit_1, fe robust

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.2602                                         min =          1
     between = 0.4865                                         avg =        1.9
     overall = 0.4685                                         max =          2

                                                F(5,36)           =       5.20
corr(u_i, Xb)  = 0.2092                         Prob > F          =     0.0011

                                     (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------
                |               Robust
      recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |   2.139538   1.002176     2.13   0.040     .1070301    4.172046
      revenue_3 |   .0000748   .0000693     1.08   0.288    -.0000658    .0002154
     ceo_exit_3 |  -.6974463    2.23078    -0.31   0.756    -5.221677    3.826785
ceo_exit_during |  -1.326178     1.8493    -0.72   0.478    -5.076733    2.424376
     ceo_exit_1 |   1.198177   1.595225     0.75   0.457    -2.037089    4.433443
          _cons |   -.383135   3.679231    -0.10   0.918    -7.844961    7.078691
----------------+----------------------------------------------------------------
        sigma_u |  5.9184271
        sigma_e |  2.6316725
            rho |  .83491953   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. xtreg recalls_3 high_turnover_3 revenue_3 ceo_exit_3 year_factor, fe robust

Fixed-effects (within) regression               Number of obs     =         71
Group variable: name                            Number of groups  =         37

R-sq:                                           Obs per group:
     within  = 0.2478                                         min =          1
     between = 0.4428                                         avg =        1.9
     overall = 0.4226                                         max =          2

                                                F(4,36)           =       3.08
corr(u_i, Xb)  = 0.3106                         Prob > F          =     0.0278

                                     (Std. Err. adjusted for 37 clusters in name)
---------------------------------------------------------------------------------
                |               Robust
      recalls_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
high_turnover_3 |    1.90663   1.131807     1.68   0.101    -.3887799    4.202041
      revenue_3 |   .0000553    .000067     0.83   0.414    -.0000805    .0001912
     ceo_exit_3 |    .656815   .9541243     0.69   0.496    -1.278239    2.591869
    year_factor |   .5291764   .8135334     0.65   0.520    -1.120746    2.179099
          _cons |   .1715389   3.416279     0.05   0.960    -6.756997    7.100075
----------------+----------------------------------------------------------------
        sigma_u |  6.3705945
        sigma_e |  2.6090975
            rho |  .85635953   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
end of do-file

. log close
      name:  <unnamed>
       log:  H:\jbarg\PycharmProjects\corporate_disruptions\workbooks\10.Run models.log
  log type:  text
 closed on:  26 Apr 2019, 02:28:40
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
